---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RasterEnableSnaps
source: html/af5ab2f4-d9e2-fb63-4856-25dcd33f00ad.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RasterEnableSnaps Property

"Enable Snaps"

## Syntax (C#)
```csharp
public static ForgeTypeId RasterEnableSnaps { get; }
```